package homework3;

public class Main {

    public static void main(String[] args) {
        Test test = new Test();
        test.experimentText("I like Java!!!");
    }
}

        //a) Напишите метод, который принимает в качестве параметра любую строку, например “I like Java!!!”.  В этом методе по очереди сделать следующее с этой строкой:
        //б) Распечатать последний символ строки.
        //в) Проверить, заканчивается ли ваша строка подстрокой “!!!”.
        //г) Проверить, начинается ли ваша строка подстрокой “I like”.
        //д) Проверить, содержит ли ваша строка подстроку “Java”.
        //e) Найти позицию подстроки “Java” в строке “I like Java!!!”.
        //ж) Заменить все символы “а” на “о”.
        //з) Преобразуйте строку к верхнему регистру.
        //и) Преобразуйте строку к нижнему регистру.
        //к) В самом конце. Вывести на экран последнее слово строк
